Repository: PDmatrix/DTX.DesignPatterns
Catalog: DTX.DesignPatterns/Properties/PatternDescription.*.resx
Languages: ru

# FactoryMethodDescription
source: Define an interface for creating an object, but let subclasses decide which class to instantiate. Lets a class defer instantiation to subclasses.
ru: Определяет интерфейс для создания объекта, но позволяет подклассам решать, какой класс инстанцировать. Позволяет делегировать создание объекта подклассам.

# SingletonDescription
source: Ensure a class only has one instance and provide a global point of access to it.
ru: Гарантирует, что класс имеет только один экземпляр и предоставляет глобальную точку доступа к нему.

# BuilderDescription
source: Separate the construction of a complex object from its representing so that the same construction process can create different representations.
ru: Разделяет создание сложного объекта и инициализацию его состояния так, что одинаковый процесс построения может создать объекты с разным состоянием.

# PrototypeDescription
source: Specify the kinds of objects to create using a prototypical instance, and create new objects by copying this prototype.
ru: Определяет несколько видов объектов, чтобы при создании использовать объект-прототип и создаёт новые объекты, копируя прототип.

# AbstractFactoryDescription
source: Provides an interface for creating families of related or dependent objects without specifying their concrete class.
ru: Предоставляет интерфейс для создания групп связанных или зависимых объектов, не указывая их конкретный класс.

# InterpreterDescription
source: Given a language, define a representation for its grammar along with an interpreter that uses the representation to interpret sentences in the language.
ru: Получая формальный язык, определяет представление его грамматики и интерпретатор, использующий это представление для обработки выражений языка.

# CommandDescription
source: Encapsulate a request as an object, thereby letting you parameterize clients with different requests, queue or log requests, and support undoable operations.
ru: Инкапсулирует запрос в виде объекта, позволяя передавать их клиентам в качестве параметров, ставить в очередь, логировать а также поддерживает отмену операций.

# MediatorDescription
source: Define an object that encapsulates how a set of objects interact. Promotes loose coupling by keeping objects from referring to each other explicitly and it lets you vary their interactions independently.
ru: Определяет объект, инкапсулирующий способ взаимодействия объектов. Обеспечивает слабую связь, избавляя объекты от необходимости прямо ссылать друг на друга и даёт возможность независимо изменять их взаимодействие.

# MementoDescription
source: Without violating encapsulation, capture and externalize an object's internal state so that the object can be restored to this state later.
ru: Не нарушая инкапсуляцию, определяет и сохраняет внутреннее состояние объекта и позволяет позже восстановить объект в этом состоянии.

# ObserverDescripton
source: Define a one-to-many dependency between objects so that when one object changes state, all its dependents are notified and updated automatically.
ru: Определяет зависимость “один ко многим” между объектами так, что когда один объект меняет своё состояние, все зависимые объекты оповещаются и обновляются автоматически.

# StateDescription
source: Allow an object to alter its behavior when its internal state changes. The object will appear to change its class.
ru: Позволяет объекту изменять своё поведение в зависимости от внутреннего состояния.

# StrategyDescription
source: Define a family of algorithms, encapsulate each one, and make them interchangeable. Lets the algorithm vary independently from clients that use it.
ru: Определяет группу алгоритмов, инкапсулирует их и делает взаимозаменяемыми. Позволяет изменять алгоритм независимо от клиентов, его использующих.

# ChainOfResponsibilityDescription
source: Avoid coupling the sender of a request to its receiver by giving more than one object a chance to handle the request. Chain the receiving objects and pass the request along the chain until an object handles it.
ru: Избегает связывания отправителя запроса с его получателем, давая возможность обработать запрос более чем одному объекту. Связывает объекты-получатели и передаёт запрос по цепочке пока объект не обработает его.

# TemplateMethodDescription
source: Define the skeleton of an algorithm in an operation, deferring some steps to subclasses. Lets subclasses redefine certain steps of an algorithm without changing the algorithm's structure.
ru: Определяет алгоритм, некоторые этапы которого делегируются подклассам. Позволяет подклассам переопределить эти этапы, не меняя структуру алгоритма.

# VisitorDescription
source: Represent an operation to be performed on the elements of an object structure. Lets you define a new operation without changing the classes of the elements on which it operates.
ru: Представляет собой операцию, которая будет выполнена над объектами группы классов. Даёт возможность определить новую операцию без изменения кода классов, над которами эта операция проводится.

# AdapterDescription
source: Convert the interface of a class into another interface clients expect. Lets classes work together that couldn't otherwise because of incompatible interfaces.
ru: Конвертирует интерфейс класса в другой интерфейс, ожидаемый клиентом. Позволяет классам с разными интерфейсами работать вместе.

# BridgeDescription
source: Decouple an abstraction from its implementation so that the two can vary independently.
ru: Разделяет абстракцию и реализацию так, чтобы они могли изменяться независимо.

# CompositeDescription
source: Compose objects into tree structures to represent part-whole hierarchies. Lets clients treat individual objects and compositions of objects uniformly.
ru: Компонует объекты в древовидную структуру, представляя их в виде иерархии. Позволяет клиенту одинаково обращаться как к отдельному объекту, так и к целому поддереву.

# DecoratorDescription
source: Attach additional responsibilities to an object dynamically. Provide a flexible alternative to sub-classing for extending functionality.
ru: Динамически предоставляет объекту дополнительные возможности. Представляет собой гибкую альтернативу наследованию для расширения функциональности.

# FacadeDescription
source: Provide a unified interface to a set of interfaces in a subsystem. Defines a high level interface that makes the subsystem easier to use.
ru: Предоставляет единый интерфейс к группе интерфейсов подсистемы. Определяет высокоуровневый интерфейс, делая подсистему проще для использования.

# FlyweightDescription
source: Use sharing to support large numbers of fine grained objects efficiently.
ru: Благодаря совместному использованию, поддерживает эффективную работу с большим количеством объектов.

# ProxyDescription
source: Provide a surrogate or placeholder for another object to control access to it.
ru: Предоставляет замену другого объекта для контроля доступа к нему.

# IteratorDescription
source: Given a language, define a representation for its grammar along with an interpreter that uses the representation to interpret sentences in the language.
ru: Предоставляет способ последовательного доступа к элементам множества, независимо от его внутреннего устройства.
